<template>
    <div class="screen-full flex-center" style="align-items: normal;">
        <div class="screen-left-up">实验习题</div>
        <div class="exercises-content">
            <div class="exercises-content-header">
                <button v-for="item in 80">习题1</button>
            </div>
            <div class="exercises-content-main">
                <div class="content-main">
                    <div>
                        <p>1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                            通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点</p>
                    </div>
                    <button v-if="!lookAnswer" @click="lookAnswer = true">查看答案</button>
                    <button v-else @click="lookAnswer = false">查看题目</button>
                </div>
                <div class="content-main">
                    <div>
                        <textarea style="width: 100%;height: 100%;font-size: 1.1rem"/>
                    </div>
                    <button>确认</button>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup>
//实验习题

//查看答案
import { ref } from "vue";

let lookAnswer = ref(false);

</script>

<style scoped>

</style>