<template>
    <div class="screen-full flex-center" style="align-items: normal;">
        <div class="screen-left-up">实验结果</div>
        <div class="result">
            <p>
                1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1.
                通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点
            </p>
            <div><span>总分47.6</span></div>
        </div>
    </div>
</template>

<script setup>
//实验结果


</script>

<style scoped>

</style>