<template>
    <transition>
        <Nav v-if="currentRouter !== '/'"/>
    </transition>
    <router-view v-slot="{Component}">
        <transition mode="out-in">
            <keep-alive>
                <component :is="Component"/>
            </keep-alive>
        </transition>
    </router-view>
</template>

<script setup>
//enter-active-class="animate__animated animate__fadeIn"
//leave-active-class="animate__animated animate__fadeOut"

import { provide, reactive, ref, watch } from "vue";
import Nav from "@/views/Nav";

let route = require('vue-router').useRoute();
let currentRouter = ref('/');
//实验
let experiment = reactive({
    //实验目的
    purpose: '1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。',
    //实验目的
    principle: '1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。1. 通过本虚拟仿真实验，认识板式精馏设备，掌握精馏原理，了解精馏操作基本步骤及要点。',
});

provide('experiment', experiment);

watch(route, () => {
    currentRouter.value = route.fullPath;
});
</script>